---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.FabricParamLocationWall
source: html/e7fdc3be-4301-00ba-c46a-4ff73ddde717.htm
---
# Autodesk.Revit.DB.ParameterTypeId.FabricParamLocationWall Property

"Location": Fabric location in the wall

## Syntax (C#)
```csharp
public static ForgeTypeId FabricParamLocationWall { get; }
```